# Paint Method (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
DocumentEntryPoint..::..Paint Method
DocumentEntryPoint Class See Also
---
# Overload List
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Paint(ElementId, Face, ElementId) | Paint the element's face with specified material.  (Inherited from Document.) |
| Paint(ElementId, Face, FamilyParameter) | Paint the element's face with specified material.  (Inherited from Document.) |

# See Also
DocumentEntryPoint Class
DocumentEntryPoint Members
Autodesk.Revit.DB.Macros Namespace